app/views/institutes/index.html.erb

        <td><%= institute.address %>, <%= institute.city %>, <%= institute.state %>, <%= institute.zipcode %></td>
        <td><%= institute.teachers.size %></td>
---
SELECT COUNT(*) FROM "teachers" WHERE "teachers"."institute_id" = $1  [["institute_id", 1]]