app/controllers/institutes_controller.rb

  def create
    @institute = Institute.new(institute_params)
    if @institute.save
---
INSERT INTO "institutes" ("address", "city", "created_at", "name", "state", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @institute = Institute.find(params[:id])
---
SELECT "institutes".* FROM "institutes" WHERE "institutes"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    @institute = Institute.find(params[:id])
    if @institute.update(institute_params)
---
SELECT "institutes".* FROM "institutes" WHERE "institutes"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "institutes" SET "zipcode" = $1, "updated_at" = $2 WHERE "institutes"."id" = 1  [["zipcode", "12345"], ["updated_at", Sun, 01 Jun 2014 21:37:42 UTC +00:00]]

  def index
    @institutes = Institute.all
---
SELECT "institutes".* FROM "institutes"

  def show
    @institute = Institute.find(params[:id])
---
SELECT "institutes".* FROM "institutes" WHERE "institutes"."id" = $1 LIMIT 1  [["id", "1"]]