app/controllers/teachers_controller.rb

  def new
    @institute = Institute.find(params[:institute_id])
---
SELECT "institutes".* FROM "institutes" WHERE "institutes"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @institute = Institute.find(params[:institute_id])
    @teacher = @institute.teachers.new(teacher_params)
    respond_to do |format|
      if @teacher.save
---
SELECT "institutes".* FROM "institutes" WHERE "institutes"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "teachers" ("created_at", "department", "email_address", "first_name", "institute_id", "last_name", "office_address", "phone_number", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def edit
    @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @teacher = Teacher.find(params[:id])
    respond_to do |format|
      if @teacher.update(teacher_params)
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "teachers" SET "last_name" = ?, "first_name" = ?, "department" = ?, "office_address" = ?, "email_address" = ?, "phone_number" = ?, "updated_at" = ? WHERE "teachers"."id" = 1

  def show
    @teacher = Teacher.find(params[:id])
---
SELECT "teachers".* FROM "teachers" WHERE "teachers"."id" = ? LIMIT 1  [["id", "1"]]

  def search
    if params[:search]
      @list_teachers = []
      Teacher.all.each do |teacher|
---
SELECT "teachers".* FROM "teachers"